'''
书写验证身份证、手机号码、网易邮箱的正则表达式
'''

'''
地区： [1-9]\d{5}
年的前两位： (18|19|([23]\d))            1800-2399
年的后两位： \d{2}
月份： ((0[1-9])|(10|11|12)) 
天数： (([0-2][1-9])|10|20|30|31)          闰年不能禁止29+

三位顺序码： \d{3}

两位顺序码： \d{2}

校验码： [0-9Xx]
'''
import re

s = '333333188209021054'
t = '^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$'
reobj = re.compile(t)
res = reobj.fullmatch(s)
print(res)

t1 = '1(3|5|7|8)(0|1|5|6|8|9)\d{8}'
reobj = re.compile(t1)
res = reobj.fullmatch("18855424020")
print(res)

t2 = '[A-Za-z0-9_]+@(163|126)\.com'
reobj = re.compile(t2)
res = reobj.fullmatch('lmj123@163.com')
print(res)